In [1]:
dataset = read.csv('Data.csv')

In [2]:
head(dataset)

  Country Age Salary Purchased
1 France  44  72000  No
2 Spain   27  48000  Yes
3 Germany 30  54000  No
4 Spain   38  61000  No
5 Germany 40     NA  Yes
6 France  35  58000  Yes

In [6]:
dataset$Age = ifelse(is.na(dataset$Age) , ave(dataset$Age , FUN = function(x) mean(x,na.rm=TRUE)),
                                              dataset$Age)

dataset$Salary = ifelse(is.na(dataset$Salary) , ave(dataset$Salary , FUN = function(x) mean(x,na.rm=TRUE)),
                                              dataset$Salary)

In [7]:
dataset

   Country Age      Salary   Purchased
1  France  44.00000 72000.00 No
2  Spain   27.00000 48000.00 Yes
3  Germany 30.00000 54000.00 No
4  Spain   38.00000 61000.00 No
5  Germany 40.00000 63777.78 Yes
6  France  35.00000 58000.00 Yes
7  Spain   38.77778 52000.00 No
8  France  48.00000 79000.00 Yes
9  Germany 50.00000 83000.00 No
10 France  37.00000 67000.00 Yes

In [8]:
dataset$Country = factor(dataset$Country ,
                        levels = c('France','Spain','Germany'),
                        labels = c(1,2,3))

dataset$Purchased = factor(dataset$Purchased ,
                        levels = c('No','Yes'),
                        labels = c(0,1))

In [9]:
dataset

   Country Age      Salary   Purchased
1  1       44.00000 72000.00 0
2  2       27.00000 48000.00 1
3  3       30.00000 54000.00 0
4  2       38.00000 61000.00 0
5  3       40.00000 63777.78 1
6  1       35.00000 58000.00 1
7  2       38.77778 52000.00 0
8  1       48.00000 79000.00 1
9  3       50.00000 83000.00 0
10 1       37.00000 67000.00 1

In [13]:
install.packages('caTools')

Warning message:
"unable to access index for repository https://cran.r-project.org/src/contrib:
  cannot open URL 'https://cran.r-project.org/src/contrib/PACKAGES'"Warning message:
"package 'caTools' is not available (for R version 3.6.1)"Warning message:
"unable to access index for repository https://cran.r-project.org/bin/windows/contrib/3.6:
  cannot open URL 'https://cran.r-project.org/bin/windows/contrib/3.6/PACKAGES'"

In [12]:
library(caTools)

ERROR: Error in library(caTools): there is no package called 'caTools'

In [ ]:
slo